12/data/attachments/2b6ffb0c8f02957b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_5063f9fa-e139-435c-b931-990b23df6a7b</nif:username>
            <nif:friendToBeAdded>Melissa_religious_Actions_79856_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>